<script src="/assets/js/jquery.min.js"></script>
<script>
   $(function(){
       $('#cabecalho').load("./cabecalho_cakephp.txt");
   });
</script>
<div id="cabecalho"></div>
<!-- Final do Cabeçalho -->

<!-- Início do conteúdo-->	
<meta charset="UTF-8" >
<style>
#conteudo{
	font-family: 'Arial', Helvetica, sans-serif;
	margin: 0 auto;
	width: 800px;
}
</style>
<br><br><br><br><br>
 	    <h2 align="center">Porque estou escrevendo este livro?</h2>
<div id="conteudo"> 	    
<p>N&atilde;o &eacute; f&aacute;cil nem t&atilde;o necess&aacute;rio escrever um livro sobre o CakePHP, visto que sua documenta&ccedil;&atilde;o &eacute; muito boa e que ele &eacute; realmente simples.<br /><br>
Basta olhar a quantidade de livros que existe sobre ele. Quando buscamos por livro ou por book sobre o Cake os primeiros retornos s&atilde;o do pr&oacute;prio book oficial do Cake <a href="http://book.cakephp.org" target="_blank">http://book.cakephp.org</a></p>

<p><strong>Fiz uma busca agora assim:</strong></p>

<p>livro cakephp 3</p>

<p>Percorri os primeiros retornos mas desisti antes de encontrar um livro sobre o Cake, nem mesmo de outra vers&atilde;o. Retornou o book oficial, apostilas, tutoriais, mas livro nenhum.</p>

<p><strong>Outra busca:</strong></p>

<p>book cakephp 3</p>

<p>Nesta os 10 primeiros itens retornados s&atilde;o do site oficial.<br />
Virando a p&aacute;gina, os pr&oacute;ximos 10 tamb&eacute;m.<br />
Virando novamente ainda 7 s&atilde;o sobre a documenta&ccedil;&atilde;o oficial.</p>

<p>Mas, se por um lado a documenta&ccedil;&atilde;o &eacute; farta e o Cake &eacute; simples, por outro lado existem lacunas que me justificaram organizar este material, primeiro para mim, guardando de forma organizada por algum tempo e agora divulgando para que possa ser &uacute;til a mais gente.</p>

<p><strong>Existem assuntos que n&atilde;o est&atilde;o bem resolvidos na documenta&ccedil;&atilde;o como:</strong><br />
- Cria&ccedil;&atilde;o de um plugin ou outra extens&atilde;o que integra GitHub, Packagist e Composer<br />
- Elabora&ccedil;&atilde;o de testes unit&aacute;rios<br />
- Cria&ccedil;&atilde;o de aplicativos customizados, sem o uso do Bake ou customizando aplicativos criados com o Bake<br />
- Um exemplo rasteiro e na unha de fun&ccedil;&atilde;o no Model/Table se comunicando com um Controller/action e saindo para um Template/view.<br />
- Implementa&ccedil;&atilde;o de busca na vers&atilde;o 3<br />
- Elabora&ccedil;&atilde;o de tutorial sobre o novo ORM e da QueryBuilder com exemplos<br />
- Implementa&ccedil;&atilde;o da formata&ccedil;&atilde;o de datas no formato brasileiro<br />
- Internacionaliza&ccedil;&atilde;o<br />
- Detalhes sobre a gera&ccedil;&atilde;o de c&oacute;digo com o Bake<br />
- Implemta&ccedil;&atilde;o completa do plugin Migrations, com cria&ccedil;&atilde;o de tabelas e cadastro de registros<br />
- Uso simples e claro de plugins para evitar altera&ccedil;&otilde;es do core<br />
- Cria&ccedil;&atilde;o e uso de Elements<br />
- Cria&ccedil;&atilde;o e uso de Layouts<br />
- Uso da biblioteca de terceiros Faker<br />
- Implementa&ccedil;&atilde;o do Bootstrap em templates<br />
- Uso detalhado do composers<br />
- Implementa&ccedil;&atilde;o simples de ACL para controle de seguran&ccedil;a<br />
- Detalhes do uso do CakePHP 3 com o SGBD PostgreSQL<br />
- Tradu&ccedil;&atilde;o de t&oacute;picos ainda n&atilde;o traduzidos na documenta&ccedil;&atilde;o oficial<br />
- Alguns exemplos customizados de aplicativos<br />
- Detalhes sobre valida&ccedil;&otilde;es<br />
- Implementando a criptografia de senhas com Bcrypt para autentica&ccedil;&atilde;o de usu&aacute;rios<br />
- Tradu&ccedil;&atilde;o manual do template do Bake<br />
- Customiza&ccedil;&otilde;es do Bake</p>

<p>Agora vejo que tenho uma boa lista de motivos para escrever este material.</p>

<p>Outro detalhe que me levou a refletir foi onde eu o hospedaria: em meu site, com mais conforto (CMS Joomla) e controle total ou ent&atilde;o hospedar em grandes reposit&oacute;rios como WikiBooks e GitHub.</p>

<p><br />
Com estes &uacute;ltimos perderei muitos recursos e usabilidade mas ganharei em visibilidade. Exietem diferen&ccedil;as entre GitHub e Wikibooks. No Wikibooks existe uma certa modera&ccedil;&atilde;o e v&aacute;rias regras a seguir.</p>

<p>No GitHub &eacute; mais livre e tranquilo. Ambos oferecem abrigo somente para conte&uacute;do est&aacute;tico e o GitHub aceita HTML, CSS e JavaScript, j&aacute; o Wikibooks n&atilde;o os aceita, apenas oferece um bem restrito editor e usa uma linguagem pr&oacute;pria, tipo o Makdown. Acabei decidindo divulgar aqui no GitHub, que &eacute; menos burocrático e &eacute; onde est&atilde;o todos os projetos que tenho criado ultimamente.</p>

<!-- Final do conteúdo -->

<!-- Rodapé-->
					<footer id="footer">
						<p><a href="htpp://ribafs.org">RibaFS</a> - ribafs @ gmail.com. All rights reserved. Design: <a href="http://templated.co">TEMPLATED</a></p>
					</footer>
</div><!-- Final de conteudo -->
		<!-- Scripts -->
			<script src="/assets/js/jquery.min.js"></script>
			<script src="/assets/js/bootstrap.min.js"></script>
			<script src="/assets/js/jquery.poptrox.min.js"></script>
			<script src="/assets/js/skel.min.js"></script>
			<script src="/assets/js/main.js"></script>
</body>
</html>
